package com.example.composeuisample

// 개발 이슈 메모

/**
 * 소스트리에서 더블 클릭시 안드로이드 스튜디오에서 파일 열기
 * 소스트리 설정:
 *  - 도구 -> 옵션 -> 파일 두 번 클릭 동작 -> 편집기에서 파일 열기
 * 파일 설정:
 *  - 우클릭 -> 연결 프로그램 -> 내 PC / 로컬 디스크 C / Program Files / Android / Android Studio / bin / studio64.exe 선택
 */

/**
 * 프로젝트 생성전 준비 사항
 * jdk 설치:
 *  - jdk를 설치하지 않으면 특정 자바 클래스를 찾지 못하는 오류가 발생할 수 있음
 */

/**
 * 안드로이드 스튜디오 자동 개행 라인수 변경 방법
 *  - Settings -> Editor -> Code Style -> Hard wrap at (Maximum line length) 필드 변경
 */

/**
 * 에뮬레이터 실행
 *  - 디바이스 매니저에서 에뮬레이터 실행
 *  - 에뮬레이터의 이름이 Run 옆에 뜨면 에뮬레이터 실행
 */

/**
 * 소스트리 깃허브 연동
 * OAuth 방식으로 깃허브 계정을 소스트리에 등록:
 *  - 소스트리 실행 -> 도구 -> 옵션 -> 인증 -> 추가
 *  - 호스팅 서비스를 GitHub로 선택
 *  - 인증 방식을 OAuth로 설정하고, OAuth 토큰 새로고침
 *  - Github 로그인 및 Atlassian(소스트리 개발사)에 권한 부여
 *
 * 로컬 저장소를 깃허브에 연결
 *  - 설정 -> 원격 -> 추가
 *  - 원격 이름 설정 (보통 origin)
 *  - URL / 경로 설정 (깃허브 저장소 경로)
 */